In [88]:
import pandas as pd

In [89]:
customer_data = pd.read_csv('C:\\Users\\LajpatraiVyas\\Downloads\\data\\CustomerAB.csv')
inapp_data = pd.read_csv('C:\\Users\\LajpatraiVyas\\Downloads\\data\\inapp.csv')
inapp_data.head()

         date       uid            sku  price
0   7/10/2017  41195147  sku_three_499    499
1   7/15/2017  41195147  sku_three_499    499
2  11/12/2017  41195147   sku_four_599    599
3   9/26/2017  91591874    sku_two_299    299
4   12/1/2017  91591874   sku_four_599    599

In [90]:
customer_data.columns

Index(['uid', 'reg_date', 'device', 'gender', 'country', 'age'], dtype='object')

In [47]:
comb_data = inapp_data.merge(customer_data,on=['uid'],how='inner')

In [48]:
comb_data.head()

,date_x,uid,sku,price,date_y,device,gender,country,age
0,7/10/2017,41195147,sku_three_499,499,2017-06-26T00:00:00Z,and,M,BRA,17
1,7/15/2017,41195147,sku_three_499,499,2017-06-26T00:00:00Z,and,M,BRA,17
2,11/12/2017,41195147,sku_four_599,599,2017-06-26T00:00:00Z,and,M,BRA,17
3,9/26/2017,91591874,sku_two_299,299,2017-01-05T00:00:00Z,and,M,TUR,17
4,12/1/2017,91591874,sku_four_599,599,2017-01-05T00:00:00Z,and,M,TUR,17

In [36]:
len(comb_data)

9006

In [37]:
comb_data1 = inapp_data.merge(customer_data,on=['uid','date'],how='inner')

In [38]:
comb_data1.head()

Empty DataFrame
Columns: [date, uid, sku, price, device, gender, country, age]
Index: []

In [44]:
purch_pri_mean, purch_pri_median = inapp_data.price.agg(['mean','median'])
purch_pri_mean
purch_pri_median

299.0

In [50]:
purch_summary = comb_data.agg({'price':['mean','median'],'age':['mean','median']})
purch_summary

             price        age
mean    406.772596  23.922274
median  299.000000  21.000000

In [59]:
group_summary = comb_data.groupby(by=['device','gender'],axis=0)

In [60]:
group_summary.agg({'price':['mean','median','std']})

                    price
                     mean median         std
device gender
and    F       400.747504    299  179.984378
       M       416.237308    499  195.001520
iOS    F       404.435330    299  181.524952
       M       405.272401    299  196.843197

In [62]:
from datetime import timedelta

In [64]:
current_date = pd.to_datetime('2018-03-17')

In [76]:
max_date = current_date - timedelta(days=28)
inapp_data_filt = inapp_data[inapp_data.date < str(max_date)]
inapp_data_filt.price.mean()

408.1800143437724

In [81]:
within_days = inapp_data_filt[inapp_data_filt.date<=(customer_data.date+str(timedelta(days=28)))]

ValueError: Can only compare identically-labeled Series objects

In [91]:
purchase_data = pd.read_csv('C:\\Users\\LajpatraiVyas\\Downloads\\data\\purchase_data.csv')

In [94]:
df = purchase_data.merge(customer_data,on=['uid'],how='inner')
df.head()

,date,uid,sku,price,reg_date,device,gender,country,age
0,2017-07-10,41195147,sku_three_499,499,2017-06-26T00:00:00Z,and,M,BRA,17
1,2017-07-15,41195147,sku_three_499,499,2017-06-26T00:00:00Z,and,M,BRA,17
2,2017-11-12,41195147,sku_four_599,599,2017-06-26T00:00:00Z,and,M,BRA,17
3,2017-09-26,91591874,sku_two_299,299,2017-01-05T00:00:00Z,and,M,TUR,17
4,2017-12-01,91591874,sku_four_599,599,2017-01-05T00:00:00Z,and,M,TUR,17

In [117]:
import numpy as np
month1 = np.where((df.reg_date < str(max_date))&(df.date<df.reg_date+str(timedelta(days=28))),df.price,np.NaN)
df['month']=month1
len(df)

9006

In [108]:
df_upd = df.groupby(by=['gender','device'],as_index=False)

In [110]:
summary=df_upd.agg({'month':['mean','median'],'price':['mean','median']})

In [111]:
summary

  gender device       month              price
                       mean median        mean median
0      F    and  475.923077  499.0  400.747504    299
1      F    iOS  427.571429  599.0  404.435330    299
2      M    and  511.500000  549.0  416.237308    499
3      M    iOS  549.000000  549.0  405.272401    299

In [160]:
df = pd.read_csv('C:\\Users\\LajpatraiVyas\\Downloads\\data\\CustomerAB.csv')
df1 = pd.read_csv('C:\\Users\\LajpatraiVyas\\Downloads\\data\\inapp.csv')
df2 = pd.read_csv('C:\\Users\\LajpatraiVyas\\Downloads\\data\\purchase_data.csv')
comb_df = df2.merge(df,on=['uid'],how='inner')
comb_df['first_week']=np.where((comb_df.date>str(current_date))&(comb_df.date<str(current_date + timedelta(days=7))),1,0)
new_data=comb_df[['reg_date','country','first_week']]
country_pivot = pd.pivot_table(new_data,values=['first_week'],columns=['country'],index=['reg_date'])

In [162]:
country_pivot.tail()

                     first_week
country                     BRA CAN  DEU FRA  TUR  USA
reg_date
2018-03-11T00:00:00Z        NaN NaN  NaN NaN  0.0  NaN
2018-03-13T00:00:00Z   0.333333 NaN  NaN NaN  NaN  NaN
2018-03-15T00:00:00Z        NaN NaN  NaN NaN  NaN  0.0
2018-03-16T00:00:00Z        NaN NaN  NaN NaN  NaN  0.0
2018-03-17T00:00:00Z        NaN NaN  0.0 NaN  0.5  NaN

In [165]:
new_data1=comb_df[['reg_date','device','first_week']]

In [166]:
country_pivot1 = pd.pivot_table(new_data1,values=['first_week'],columns=['device'],index=['reg_date'])
country_pivot1.head()

                     first_week
device                      and  iOS
reg_date
2015-01-27T00:00:00Z        NaN  0.0
2015-02-01T00:00:00Z        0.0  NaN
2015-02-09T00:00:00Z        0.0  NaN
2015-02-10T00:00:00Z        NaN  0.0
2015-03-01T00:00:00Z        NaN  0.0